tutorials/uvReactorSozzi2006-DOM/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1
set -e

. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# DOM-driven version of the Sozzi & Taghipour 2006 L-shape annular
# reactor tutorial. The flow solve, mesh, and radiationDose post-
# process are identical to the analytical-G sibling tutorial
# (../uvReactorSozzi2006); the source of G is the only difference.
# Here we run opticalRadiationFoam on the converged flow snapshot
# and use its DOM-computed G field to drive the Lagrangian dose
# tracker, where the sibling case uses setFluenceRate's analytical
# infinite-line formula.

# Clean prior state so runApplication does not skip on stale log.<app>.
./Allclean > /dev/null 2>&1 || true

if [ ! -d constant/polyMesh ]; then
    ./Allmesh
fi

# Stage 1: steady RANS flow solve.
runApplication foamRun

# Stage 2: DOM radiation on the converged flow snapshot.
LATEST=$(foamListTimes -case . -latestTime)
if [ -z "$LATEST" ]; then
    echo "Allrun: no time directory found after foamRun" >&2
    exit 1
fi
echo "Allrun: flow converged at t=$LATEST; running DOM"

# Seed the per-ray I template into the flow's latest time so
# opticalRadiationFoam (startFrom latestTime) finds it on disk.
cp 0/I "$LATEST/I"

# Swap to the DOM controlDict, run, swap back. The flow controlDict
# is restored on exit so subsequent re-runs keep working.
mv system/controlDict system/controlDict.flow.bak
cp system/controlDict.DOM system/controlDict
trap 'mv system/controlDict.flow.bak system/controlDict 2>/dev/null || true' EXIT
runApplication opticalRadiationFoam
mv system/controlDict.flow.bak system/controlDict
trap - EXIT

DOMTIME=$(foamListTimes -case . -latestTime)
echo "Allrun: DOM wrote I and G to t=$DOMTIME"

# Stage 3: bring flow fields forward so radiationDose sees U and G in
# the same time directory.
for f in U k epsilon nut p; do
    if [ -f "$LATEST/$f" ] && [ ! -f "$DOMTIME/$f" ]; then
        cp "$LATEST/$f" "$DOMTIME/"
    fi
done

# Stage 4: Lagrangian dose post-process.
runApplication foamPostProcess -dict system/postProcess.dict -latestTime

# Stage 5: convert flow + DOM fields to VTK so ParaView can render
# the G field and velocity streamlines alongside the trajectories.vtk
# that the dose tracker already writes.
runApplication foamToVTK -time "$LATEST,$DOMTIME" -fields "(U G k epsilon p)"

echo "Allrun: done; results in postProcessing/radiationDose/$DOMTIME/"
