tutorials/uvReactorSozzi2006-DOM/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: water at 20 C
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

rho             [1 -3 0 0 0 0 0] 998;

nu              [0 2 -1 0 0 0 0] 1e-06;

// ************************************************************************* //
