tutorials/uvReactorSozzi2006-DOM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: LTS pseudo-transient schemes
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Local time stepping: each cell uses its own pseudo-time step driven
// by local CFL. Equivalent to a PIMPLE-style relaxation toward steady
// state, but typically converges further than steadyState SIMPLE on
// flows with strong jets / recirculation (where SIMPLE residuals
// plateau early).

ddtSchemes
{
    default         localEuler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // DOM ray transport (one finite-volume convection equation per
    // ray bin per band; the rays' "velocity" is the discrete direction
    // unit vector, named Ji internally by the radiationModel).
    div(Ji,Ii_h)    bounded Gauss linearUpwind grad(Ii_h);
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
