tutorials/uvReactorSozzi2006-DOM/system/postProcess.dict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: post-process function objects
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      postProcess;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Run with:
//   setFluenceRate -latestTime              (writes G to latest time dir)
//   foamPostProcess -dict system/postProcess.dict -latestTime
//

radiationDose
{
    type            radiationDose;
    libs            ("libradiationDose.so");

    U               U;
    fluenceRate     G;
    seed            42;

    seeding
    {
        type        patchInjection;
        patches     (inlet);
        // Match Sozzi 2006's 10000 particles for tight dose statistics.
        nParticles  10000;
    }

    dispersion
    {
        type        discreteRandomWalk;
        k           k;
        epsilon     epsilon;
        Cl          0.15;
    }

    termination
    {
        escapePatches   (outlet);
        maxTime         300;
        maxDose         0;
        wallReflection  true;
    }

    integration
    {
        dtMax           0.005;
        cflMax          0.5;
        maxOuterSteps    200000;
    }

    output
    {
        kInact          (0.1);
    }
}

// ************************************************************************* //
